In [107]:
##enumerate 함수 : 열거하다 
##많은 양의 데이터인 list를 다룰 때 편리하게 쓸 수 있는 기능을 제공 
##for-each, for 
##for x in list: 리스트에 있는 것을 하나씩 꺼내서 처리하기가 간단하다. 단점은 
##               index가 없어서 불편. 
##               하나씩 꺼내서 출력이나 연산하기는 용이 
##               리스트에 입력은 안된다. 
##for i in range(n): 리스트의 입력과 출력이 다 됨. 
##               인덱스로 리스트에 있는 값들을 접근해야 하기 때문에 
##               코드가 복잡하게 보인다. 
from sklearn.model_selection import KFold 
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [108]:
num_list = [100, 200, 300]

In [109]:
for x in num_list:
    print(x+100) #인덱스가 없어서 출력하기는 용이하나 입력은 되지 않는다.

200
300
400

In [110]:
for x in enumerate(num_list): #enumerate에 쓰면 값 뿐만 아니라 인덱스도 같이 튜플 형식으로 꺼내온다. 
    print(x)

(0, 100)
(1, 200)
(2, 300)

In [111]:
for i, x in enumerate(num_list): 
    print(i,':',x)

0 : 100
1 : 200
2 : 300

In [112]:
for i, x in enumerate(num_list): #튜플이기 때문에 인덱스와 값을 한꺼번에 가지고 온다. 인덱스가 필요할 경우 enumerate함수 쓰면 된다. 
    num_list[i] = x + 100

In [113]:
num_list

[200, 300, 400]

In [114]:
kfold = KFold(n_splits = 5) #5분에 1로 유효성 검증을 하게 된다.

In [115]:
titanic_df = pd.read_csv('../csv-data/titanic_train.csv')
titanic_df.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0,NaN,S,NaN,"Cornwall / Akron, OH"

In [116]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 898 entries, 0 to 897
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     898 non-null    int64
 1   survived   898 non-null    int64
 2   name       898 non-null    object
 3   sex        898 non-null    object
 4   age        728 non-null    float64
 5   sibsp      898 non-null    int64
 6   parch      898 non-null    int64
 7   ticket     898 non-null    object
 8   fare       898 non-null    float64
 9   cabin      211 non-null    object
 10  embarked   896 non-null    object
 11  body       84 non-null     float64
 12  home.dest  516 non-null    object
dtypes: float64(3), int64(4), object(6)
memory usage: 91.3+ KB

In [117]:
##함수(drop 처리)

#def fdrop(x):
#   del titanic_df['x']
    
def fillna(df):
    df['age'].fillna(df['age'].mean(), inplace=True)
    df['cabin'].fillna('N', inplace=True)
    df['embarked'].fillna('N', inplace=True)
    return df
    
##name, ticket, body, home, dest

In [118]:
fillna(titanic_df)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.000000,0,1,250644,19.5000,N,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.000000,1,1,29103,23.0000,N,S,NaN,"Cornwall / Akron, OH"
2,2,1,"Duran y More, Miss. Florentina",female,30.000000,1,0,SC/PARIS 2148,13.8583,N,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,3,0,"Scanlan, Mr. James",male,30.196882,0,0,36209,7.7250,N,Q,NaN,NaN
4,3,1,"Bradley, Miss. Bridget Delia",female,22.000000,0,0,334914,7.7250,N,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...
893,3,0,"Davies, Mr. Joseph",male,17.000000,2,0,A/4 48873,8.0500,N,S,NaN,"West Bromwich, England Pontiac, MI"
894,3,0,"Lockyer, Mr. Edward",male,30.196882,0,0,1222,7.8792,N,S,153.0,NaN
895,1,0,"Fortune, Mr. Mark",male,64.000000,1,4,19950,263.0000,C23 C25 C27,S,NaN,"Winnipeg, MB"
896,3,1,"Dorking, Mr. Edward Arthur",male,19.000000,0,0,A/5. 10482,8.0500,N,S,NaN,"England Oglesby, IL"
897,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.000000,1,0,13508,136.7792,C89,C,NaN,"Los Angeles, CA"

In [119]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 898 entries, 0 to 897
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     898 non-null    int64
 1   survived   898 non-null    int64
 2   name       898 non-null    object
 3   sex        898 non-null    object
 4   age        898 non-null    float64
 5   sibsp      898 non-null    int64
 6   parch      898 non-null    int64
 7   ticket     898 non-null    object
 8   fare       898 non-null    float64
 9   cabin      898 non-null    object
 10  embarked   898 non-null    object
 11  body       84 non-null     float64
 12  home.dest  516 non-null    object
dtypes: float64(3), int64(4), object(6)
memory usage: 91.3+ KB

In [120]:
def drop_features(df):
    df.drop(columns=['name','ticket','body','home.dest'], inplace=True)
    return df

In [121]:
titanic_df = drop_features(titanic_df)

In [122]:
#함수 (na처리)
#age는 평균으로 채워주세요 
#cabin은 N으로 채워주세요 
#embarked는 N으로 채워주세요(fillna)
#na개수가 몇개인지 전체 카운트

In [123]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 898 entries, 0 to 897
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    898 non-null    int64
 1   survived  898 non-null    int64
 2   sex       898 non-null    object
 3   age       898 non-null    float64
 4   sibsp     898 non-null    int64
 5   parch     898 non-null    int64
 6   fare      898 non-null    float64
 7   cabin     898 non-null    object
 8   embarked  898 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 63.3+ KB

In [124]:
##라벨인코딩 : sex, cabin, embarked

In [125]:
titanic_df['cabin']

0                N
1                N
2                N
3                N
4                N
          ...
893              N
894              N
895    C23 C25 C27
896              N
897            C89
Name: cabin, Length: 898, dtype: object

In [126]:
titanic_df['cabin'] = titanic_df['cabin'].str[:1]
list(titanic_df['cabin'])[:10]

['N', 'N', 'N', 'N', 'N', 'N', 'E', 'N', 'C', 'E']

In [127]:
from sklearn.preprocessing import LabelEncoder

In [128]:
def label_encoding(df):
    df['cabin']=df['cabin'].str[:1]
    le = LabelEncoder() 
    features = ['sex','cabin','embarked']
    for f in features: 
        le.fit(df[f])
        print('라벨링할 목록=>',le.classes_)
        df[f] = le.transform(df[f])    
    return df

In [129]:
label_encoding

In [130]:
##전처리 담당 함수 만들기 
def preprocessing(df):
    df2 = fillna(df)
    df3 = drop_features(df2)
    df4 = label_encoding(df3)
    return df4

In [131]:
titanic_df2 = pd.read_csv('../csv-data/titanic_train.csv')
titanic_df2.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0,NaN,S,NaN,"Cornwall / Akron, OH"

In [132]:
#데이터 전처리 호출 
titanic_df3 = preprocessing(titanic_df2)
titanic_df3

라벨링할 목록=> ['female' 'male']
라벨링할 목록=> ['A' 'B' 'C' 'D' 'E' 'F' 'G' 'N' 'T']
라벨링할 목록=> ['C' 'N' 'Q' 'S']

     pclass  survived  sex        age  sibsp  parch      fare  cabin  embarked
0         2         1    0  13.000000      0      1   19.5000      7         3
1         2         1    0   4.000000      1      1   23.0000      7         3
2         2         1    0  30.000000      1      0   13.8583      7         0
3         3         0    1  30.196882      0      0    7.7250      7         2
4         3         1    0  22.000000      0      0    7.7250      7         2
..      ...       ...  ...        ...    ...    ...       ...    ...       ...
893       3         0    1  17.000000      2      0    8.0500      7         3
894       3         0    1  30.196882      0      0    7.8792      7         3
895       1         0    1  64.000000      1      4  263.0000      2         3
896       3         1    1  19.000000      0      0    8.0500      7         3
897       1         1    0  26.000000      1      0  136.7792      2         0

[898 rows x 9 columns]

In [133]:
#train_test data split 
data = ['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'cabin','embarked']
X_train, X_test, y_train, y_test = train_test_split(#문제, 정답, test-size비율, 시드값 설정
                                    titanic_df3[data],
                                    titanic_df3['survived'],
                                    test_size = 0.2,
                                    random_state = 11
                            )

In [134]:
titanic_df3.columns

Index(['pclass', 'survived', 'sex', 'age', 'sibsp', 'parch', 'fare', 'cabin',
       'embarked'],
      dtype='object')

In [136]:
X_train.shape

(718, 8)

In [141]:
y_train.shape

(718,)

In [138]:
y_test.shape

(180,)

In [140]:
X_test.shape

(180, 8)

In [142]:
##8개의 변수로 1개의 target을 분류하는 문제 
## y = ax1  + bx2 + cx3 + dx4 + ex5 + fx6 + gx7 + hx7
#['pclass','survived','sex','age','sibsp','parch','fare','cabin','embarked']
## survive = a*pclass + b*sex + c*age+d*sibsp + e*parch+f*fare+g*cabin+h*embarked + y절편